# 1) SQL QUERY FOR BOOKING & REVENUE

In [1]:
import pandas as pd
import sqlalchemy
import pymysql
import numpy as np
import calendar
import datetime
engine = sqlalchemy.create_engine("mysql+pymysql://nitesh.kr:yRpRtyJR0XSqVLibLT@dms002.healthians.co.in/testenv_prod")
query = ''' 
SELECT billing_cust_city, Sample_Date,Agent_name,Manager_Name,Dept_Name,booked_from,
delivery_status,
		COUNT(order_id) Bookings, 	
		
		COUNT(IF(sample_collecor_id >0 AND delivery_status = 3 AND sample_collection_time < cancelled_date,order_id,
                          IF(sample_collecor_id >0 AND delivery_status = 13 AND sample_collection_time < reshedule_date,order_id,
                          IF(sample_collecor_id >0 AND delivery_status NOT IN (3,13),order_id,NULL)))) 'Allocated_count',
                          
                    SUM(IF((is_sample_collected = 1 AND channel_type=0),1,
                     IF((is_sample_collected=1 AND channel_type<>0 AND payed_amount>0),1,0))) 'Picked_Orders', 

SUM(IF(delivery_status IN (3),1,0)) AS 'Cancelled_orders',

SUM(IF(delivery_status IN (13,26,27),1,0)) AS 'Rescheduled_OnHold_Orders',
                     
                     
                     SUM(IF((is_sample_collected = 1 AND channel_type=0),1,0)) 'Picked_Orders_B2C',
                     
                     SUM(IF((is_sample_collected=1 AND channel_type<>0 AND payed_amount>0),1,0)) 'Picked Orders_B2B', 
                     

                   SUM(IF(ref_booking_id = 0 AND delivery_status IN (0,-1,3,13),order_price,IF(ref_booking_id = 0 
                       AND delivery_status NOT IN (0,-1,3,13),allocated_amount,0))) 'BOOKING_AMOUNT',
                   
                   
		   SUM(IF(DATE(order_date) < CURDATE(),IF(delivery_status IN (0,-1,3,13), order_price, 
		   IF(DATE(sample_collection_time) <= CURDATE(), allocated_amount, order_price)), 
		   IF(delivery_status NOT IN (0,-1,3),order_price,0))) AS 'booking_amount_New',
                     
                   
                   
                          SUM(IF(sample_collecor_id >0 AND delivery_status = 3 AND sample_collection_time < cancelled_date,allocated_amount,
                          IF(sample_collecor_id >0 AND delivery_status = 13 AND sample_collection_time < reshedule_date,allocated_amount,
                          IF(sample_collecor_id >0 AND delivery_status NOT IN (3,13),allocated_amount,0)))) 'Allocated_amount',
                                    
                     
         
                     SUM(IF((is_sample_collected = 1 AND channel_type=0), payed_amount,
                     IF((is_sample_collected=1 AND channel_type<>0 AND payed_amount>0),payed_amount,0))) 'Overall_Revenue',
                     
                     
                     SUM(IF((New_no = Old_no AND is_sample_collected = 1 AND channel_type=0), payed_amount,
                     IF((New_no = Old_no AND is_sample_collected=1 AND channel_type<>0 AND payed_amount>0),payed_amount,0))) 'Overall_Revenue_Existing',
                     
                   
                     
                     SUM(IF(is_sample_collected = 1 AND channel_type=0, payed_amount,0)) 'Revenue_B2C',
                     
                     SUM(IF(is_sample_collected=1 AND channel_type<>0 AND payed_amount>0,payed_amount,0)) 'Revenue_B2B',
                     
                     
                     SUM(IF((booked_from != 'phlebo_app' AND is_sample_collected=1
                     AND payed_amount > allocated_amount),payed_amount - allocated_amount,
                     IF((booked_from = 'phlebo_app' AND is_sample_collected=1),payed_amount,0))) 
                     'Phlebo_addon',

               
                     
                     SUM(IF(sample_collection_time > NOW()
                     AND delivery_status NOT IN (-1,0,1,3,13,18,23),order_price,0)) need_to_be_collected ,
                     SUM(Existing_cust_order_count) 'Existing_cust_order',
                     COUNT(DISTINCT c_order_id) 'customer_count'
                     
                     FROM (
                     SELECT X.billing_cust_tel 'Old_no',X1.billing_cust_tel 'New_no',
                     IF(X.billing_cust_tel = X1.billing_cust_tel,1,0)'Existing_cust_order_count',                     
                     X.is_sample_collected, X.sample_collecor_id,allocated_amount,billing_cust_city,
                     X.order_id, X.ref_booking_id,X.order_price, X.payed_amount, X.sample_collection_time, 
                     X.order_date, X.delivery_status,X.booked_from,X.created_by,X.channel_type,
                     X.Agent_name,X.Manager_Name,X.Dept_Name,DATE(X.sample_collection_time) 'Sample_Date',X1.Max_date,
                     X.cancelled_date,X.reshedule_date,
                     cancelled_after,reshedule_after,X.allocated_amount_new,X.allocated_count_new, X.c_order_id
                                 
                     FROM
                     
                     (SELECT d.billing_cust_tel,d.is_sample_collected, d.sample_collecor_id,allocated_amount,billing_cust_city,
                     GROUP_CONCAT(DISTINCT u.contact_number), d.order_id, d.ref_booking_id,d.order_price, d.payed_amount, d.sample_collection_time, 
                     d.order_date, d.delivery_status,d.booked_from,d.created_by,d.channel_type,
                     IF(d.booked_from = 'crm',cu.name,IF(d.booked_from = 'phlebo_app',sc.name,0))
                     AS 'Agent_name',IF(d.booked_from = 'crm',cu1.name, IF(d.booked_from = 'phlebo_app',cu2.name,0)) AS 'Manager_Name',
                     IF(d.booked_from = 'crm',dm.dept_name,IF(d.booked_from='phlebo_app',dm1.dept_name,0)) AS 'Dept_Name',
                     camp_id,od.cancelled_date, d.reshedule_date,c_order_id,
                     IF(d.sample_collecor_id >0 AND d.delivery_status = 3 AND d.sample_collection_time < od.cancelled_date,1,0) 'cancelled_after',
                     IF(d.sample_collecor_id >0 AND d.delivery_status = 13 AND d.sample_collection_time < d.reshedule_date,1,0) 'reshedule_after',
                     
                     IF(d.sample_collecor_id >0 AND d.delivery_status = 3 AND d.sample_collection_time < od.cancelled_date,allocated_amount,
                          IF(d.sample_collecor_id >0 AND d.delivery_status = 13 AND d.sample_collection_time < d.reshedule_date,allocated_amount,
                          IF(d.sample_collecor_id >0 AND d.delivery_status NOT IN (3,13),allocated_amount,0))) 'allocated_amount_new',
                          
                      IF(d.sample_collecor_id >0 AND d.delivery_status = 3 AND d.sample_collection_time < od.cancelled_date,1,
                          IF(d.sample_collecor_id >0 AND d.delivery_status = 13 AND d.sample_collection_time < d.reshedule_date,1,
                          IF(d.sample_collecor_id >0 AND d.delivery_status NOT IN (3,13),1,0))) 'allocated_count_new'
                     
                     
                     FROM deal_order_management d 
                     LEFT JOIN deal_orders_child doc ON d.order_id = doc.order_id
                     LEFT JOIN order_details od ON doc.c_order_id = od.doc_id 
                     LEFT JOIN deal_user_management u ON doc.cust_id = u.user_id 
                    
                     LEFT JOIN crm_users AS cu ON d.created_by = cu.id
                     LEFT JOIN sample_collector sc ON d.created_by = sc.sid
                     LEFT JOIN crm_users AS cu1 ON cu1.id = cu.reporting_to
                     LEFT JOIN crm_users AS cu2 ON sc.supervisorID = cu2.id
                     LEFT JOIN dept_master AS dm ON dm.id = cu.dept_id
                     LEFT JOIN dept_master AS dm1 ON dm1.id = sc.dept_id
                     WHERE DATE(d.sample_collection_time) 
                     BETWEEN 
                     LAST_DAY(CURDATE() - INTERVAL 1 MONTH)+ INTERVAL 1 DAY 
                     AND 
                     curdate() 
                     GROUP BY d.order_id) X
                     LEFT JOIN
                     (SELECT dom.billing_cust_tel, MAX(DATE(dom.sample_collection_time)) 'Max_date', COUNT(dom.order_id) FROM deal_order_management dom
                     WHERE DATE(dom.sample_collection_time) < LAST_DAY(CURDATE() - INTERVAL 1 MONTH)+ INTERVAL 1 DAY GROUP BY dom.billing_cust_tel) X1
                     ON X.billing_cust_tel = X1.billing_cust_tel GROUP BY X.order_id) X2
                     GROUP BY billing_cust_city,Sample_Date,Agent_name,dept_name'''
df_master = pd.read_sql_query(query,engine)
engine.dispose()
df_master.head()

,billing_cust_city,Sample_Date,Agent_name,Manager_Name,Dept_Name,booked_from,delivery_status,Bookings,Allocated_count,Picked_Orders,...,booking_amount_New,Allocated_amount,Overall_Revenue,Overall_Revenue_Existing,Revenue_B2C,Revenue_B2B,Phlebo_addon,need_to_be_collected,Existing_cust_order,customer_count
0,Agra,2019-05-01,0,0,0,consumer_app,26,3,3,2.0,...,2392.0,2392.0,1633.0,0.0,1633.0,0.0,300.0,0.0,0.0,3
1,Agra,2019-05-01,Arvin Kumar Vimal,Bhawna Anand,Outbound Sales,crm,26,1,1,0.0,...,998.0,998.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1
2,Agra,2019-05-01,Faijal,Prateek Sharma,Outbound Sales,crm,26,1,1,0.0,...,2000.0,2000.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,1
3,Agra,2019-05-01,Gaurav,Prateek Sharma,Outbound Sales,crm,26,1,1,0.0,...,1599.0,1599.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,1
4,Agra,2019-05-01,Javid Ahmad,Prateek Sharma,Outbound Sales,crm,13,1,0,0.0,...,8000.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,1

# 2) SQL QUERY FOR GROSS MARGIN

In [2]:

engine = sqlalchemy.create_engine("mysql+pymysql://nitesh.kr:yRpRtyJR0XSqVLibLT@dms002.healthians.co.in/testenv_prod")
query = ''' SELECT SUM(od.addon_cost)AS sum_addon_cost,dom.payed_amount AS payed_amount,dom.sample_collection_time,dom.order_id, billing_cust_city, dom.booked_from,
 dom.allocated_amount,DATE(dom.sample_collection_time)
	
	FROM deal_order_management dom LEFT JOIN deal_orders_child doc ON dom.order_id = doc.order_id
LEFT JOIN order_details od ON doc.c_order_id = od.doc_id

WHERE od.id IS NOT NULL AND
dom.is_sample_collected = 1 AND channel_type = 0 AND
dom.delivery_status NOT IN (-1,0,3,13) AND 
doc.delivery_status NOT IN (-1,2,3,4,5,6,13,14,18,23,27) AND doc.addon_flag != -1 AND
(od.order_delivery_status NOT IN (-1,2,3,4,5,6,13,14,18,23,27) OR  od.order_delivery_status IS NULL)
AND od.addon_flag !=-1 
AND DATE(dom.sample_collection_time) 
BETWEEN 
LAST_DAY(CURDATE() - INTERVAL 1 MONTH)+ INTERVAL 1 DAY 
AND 
curdate() 

AND (dom.role_id NOT IN (6,27) AND dom.created_by NOT IN (124,230,509))
 
GROUP BY dom.order_id'''
df_margin = pd.read_sql_query(query,engine)
engine.dispose()
df_margin.head()

,sum_addon_cost,payed_amount,sample_collection_time,order_id,billing_cust_city,booked_from,allocated_amount,DATE(dom.sample_collection_time)
0,325.0,0,2019-05-22 07:00:00,787396591,Amritsar,consumer_app,1599.0,2019-05-22
1,660.0,0,2019-05-08 11:00:00,874648221,Delhi,crm,0.0,2019-05-08
2,60.0,0,2019-05-18 09:30:00,898459121,Ghaziabad,crm,0.0,2019-05-18
3,556.0,0,2019-05-18 06:30:00,899605632,Mumbai,crm,0.0,2019-05-18
4,15.0,0,2019-05-11 08:00:00,903250301,Delhi,crm,0.0,2019-05-11

# 3) SQL QUERY FOR LEADS DATA

In [3]:
engine = sqlalchemy.create_engine("mysql+pymysql://nitesh.kr:yRpRtyJR0XSqVLibLT@dms002.healthians.co.in/testenv_prod")
query = ''' 
SELECT mas.city_check_final AS 'CITY', mas.Google_Facebook AS 'Leads_Tag',DATE(mas.xcreated) 'created_on',

COUNT(DISTINCT mas.lead_id) AS 'Leads' FROM 
(
SELECT  DISTINCT	 
	 IF(IF(IF(lal.lead_source IN (8,13,14,18,36,37), 'NCR', 
	IF((IF(lal.lead_city_name = '', dc.city_name,lal.lead_city_name) IS NULL OR  
		IF(lal.lead_city_name = '', dc.city_name,lal.lead_city_name) = '') AND 
		ad_name IS NOT NULL, 
		TRIM(SUBSTRING_INDEX(TRIM(SUBSTRING_INDEX(ad_name,'L:',-1)),',',1)),
		IF(lal.lead_city_name = '', dc.city_name,
		  lal.lead_city_name)))IS NULL, dom.billing_cust_city,
		  IF(lal.lead_source IN (8,13,14,18,36,37), 'NCR', 
	IF((IF(lal.lead_city_name = '', dc.city_name,lal.lead_city_name) IS NULL OR  
		IF(lal.lead_city_name = '', dc.city_name,lal.lead_city_name) = '') AND 
		ad_name IS NOT NULL, 
		TRIM(SUBSTRING_INDEX(TRIM(SUBSTRING_INDEX(ad_name,'L:',-1)),',',1)),IF(lal.lead_city_name = '', dc.city_name,
		  lal.lead_city_name)))) IS NULL,LEFT(lal.utm_campaign,LOCATE('-',lal.utm_campaign)-1),
		  
		  IF(IF(lal.lead_source IN (8,13,14,18,36,37), 'NCR', 
	IF((IF(lal.lead_city_name = '', dc.city_name,lal.lead_city_name) IS NULL OR  
		IF(lal.lead_city_name = '', dc.city_name,lal.lead_city_name) = '') AND 
		ad_name IS NOT NULL, 
		TRIM(SUBSTRING_INDEX(TRIM(SUBSTRING_INDEX(ad_name,'L:',-1)),',',1)),IF(lal.lead_city_name = '', dc.city_name,
		  lal.lead_city_name)))IS NULL, dom.billing_cust_city,
		  IF(lal.lead_source IN (8,13,14,18,36,37), 'NCR', 
	IF((IF(lal.lead_city_name = '', dc.city_name,lal.lead_city_name) IS NULL OR  
		IF(lal.lead_city_name = '', dc.city_name,lal.lead_city_name) = '') AND 
		ad_name IS NOT NULL, 
		TRIM(SUBSTRING_INDEX(TRIM(SUBSTRING_INDEX(ad_name,'L:',-1)),',',1)),IF(lal.lead_city_name = '', dc.city_name,
		  lal.lead_city_name)))))	
		  AS city_check_final,
		  IF(lal.lead_source IN (3,4,118,122), "Premium leads","Non Premium leads") AS lead_tag,
		  IF(lal.lead_source = 3,"Facebook",IF(lal.lead_source IN (4,69,118,122),"Google",
		  IF(lal.lead_source IN (13,14,15,16,27,28,36,37,38,44,49,50,52,79,82,93,101,116),"SMS_Campaigns","Others")))'Google_Facebook',

lm.lead_id,dom.order_id,lal.lead_source,dc.city_name,DATE(lal.created_on) 'xcreated'
FROM lead_master AS lm
LEFT JOIN 
lead_activity_log AS lal ON lm.lead_id = lal.lead_id 
LEFT JOIN
deal_order_management AS dom ON dom.billing_cust_tel = lm.contact_number AND DATE(dom.order_date) >= DATE(lal.created_on)
LEFT JOIN
lead_source AS ls ON ls.id = lal.lead_source
LEFT JOIN
deal_city AS dc ON lal.lead_city = dc.city_id
LEFT JOIN
crm_users AS cu ON cu.id = lal.agent_id
WHERE DATE(lal.created_on) BETWEEN 
(LAST_DAY(CURDATE() - INTERVAL 1 MONTH)) 
AND 
(CURDATE() - INTERVAL 1 day) 
AND lal.is_new_interest=1) AS mas
GROUP BY mas.city_check_final,mas.Google_Facebook,DATE(mas.xcreated)
ORDER BY mas.city_check_final,mas.Google_Facebook,DATE(mas.xcreated)'''
df_lead = pd.read_sql_query(query,engine)
engine.dispose()
df_lead.head()

C:\Users\nitesh.kumar\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1292, "Truncated incorrect INTEGER value: 'pune'")
  result = self._query(query)
C:\Users\nitesh.kumar\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1292, "Truncated incorrect INTEGER value: 'Bengaluru'")
  result = self._query(query)
C:\Users\nitesh.kumar\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1292, "Truncated incorrect INTEGER value: 'bengaluru'")
  result = self._query(query)
C:\Users\nitesh.kumar\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1292, "Truncated incorrect INTEGER value: 'ncr'")
  result = self._query(query)
C:\Users\nitesh.kumar\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1292, "Truncated incorrect INTEGER value: 'hyderabad'")
  result = self._query(query)
C:\Users\nitesh.kumar\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1292, "Truncated incorrect INTEGER value: 'chandigarh'")
  result = self._query(query)
C:\Users\nitesh.kumar\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1292, "Truncated incorrect INTEGER value: 'Noida'")
  result = self._query(query)

   CITY Leads_Tag  created_on  Leads
0  None  Facebook  2019-04-30     17
1  None  Facebook  2019-05-01     12
2  None  Facebook  2019-05-02     16
3  None  Facebook  2019-05-03      9
4  None  Facebook  2019-05-04     14

# 4) SQL QUERY FOR KIT COST

In [4]:
engine = sqlalchemy.create_engine("mysql+pymysql://nitesh.kr:yRpRtyJR0XSqVLibLT@dms002.healthians.co.in/testenv_prod")
query = '''SELECT xdate, billing_cust_city, SUM(IF(bd = 'not_bd',custs,0)) 'NON_BD_customers'
FROM
(SELECT order_id, MIN(DATE(b1.sample_collection_time)) xmin, MAX(DATE(b1.sample_collection_time)) xmax, 
billing_cust_city, bd, COUNT(DISTINCT cust_id) custs, DATE(sample_collection_time) AS xdate
FROM
(SELECT d1.order_id, d1.cust_id, d.delivery_status, d.sample_collection_time, 
IF(d.billing_cust_city = 23,'Gurgaon',IF(d.billing_cust_city = 1595,'Delhi',d.billing_cust_city)) billing_cust_city, d.is_sample_collected, d.billing_cusT_name, d1.customer_name, d.payed_amount,
IF(d.channel_type = 0,'not_bd','bd') bd
FROM deal_order_management d
LEFT JOIN deal_orders_child d1
ON d.order_id = d1.order_id
WHERE DATE(d.sample_collection_time) BETWEEN 
LAST_DAY(CURDATE() - INTERVAL 1 MONTH)+ INTERVAL 1 DAY 
AND 
curdate() 
AND is_sample_collected = 1
AND d.delivery_status IN (7,8,9,12,15,21,23,18,26,25,27,28)) b1
GROUP BY order_id) b2
GROUP BY billing_cust_city, xdate
ORDER BY 'NON_BD_customers' DESC'''
df_kit = pd.read_sql_query(query,engine)
df_kit['kit_cost'] = df_kit['NON_BD_customers']*33.5
engine.dispose()
df_kit.head()

C:\Users\nitesh.kumar\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1292, "Truncated incorrect DOUBLE value: 'Amritsar'")
  result = self._query(query)
C:\Users\nitesh.kumar\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1292, "Truncated incorrect DOUBLE value: 'Delhi'")
  result = self._query(query)
C:\Users\nitesh.kumar\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1292, "Truncated incorrect DOUBLE value: 'Ghaziabad'")
  result = self._query(query)
C:\Users\nitesh.kumar\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1292, "Truncated incorrect DOUBLE value: 'Mumbai'")
  result = self._query(query)
C:\Users\nitesh.kumar\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1292, "Truncated incorrect DOUBLE value: 'Pune'")
  result = self._query(query)
C:\Users\nitesh.kumar\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1292, "Truncated incorrect DOUBLE value: 'Gurgaon'")
  result = self._query(query)
C:\Users\nitesh.kumar\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1292, "Truncated incorrect DOUBLE value: 'Bengaluru'")
  result = self._query(query)
C:\Users\nitesh.kumar\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1292, "Truncated incorrect DOUBLE value: 'Noida'")
  result = self._query(query)
C:\Users\nitesh.kumar\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1292, "Truncated incorrect DOUBLE value: 'Kanpur'")
  result = self._query(query)
C:\Users\nitesh.kumar\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1292, "Truncated incorrect DOUBLE value: 'Dehradun'")
  result = self._query(query)

        xdate billing_cust_city  NON_BD_customers  kit_cost
0  2019-05-22          Amritsar              20.0     670.0
1  2019-05-08             Delhi             324.0   10854.0
2  2019-05-18         Ghaziabad              81.0    2713.5
3  2019-05-18            Mumbai              81.0    2713.5
4  2019-05-11             Delhi             318.0   10653.0

# 5) SQL QUERY FOR FACEBOOK COST

In [5]:
engine = sqlalchemy.create_engine("mysql+pymysql://nitesh.kr:yRpRtyJR0XSqVLibLT@dms002.healthians.co.in/testenv_prod")
query = '''
SELECT SUBSTRING(lcd.campaign_name,3,LOCATE(',',lcd.campaign_name,1)-3)
AS 'city',ROUND(SUM(sms_rate),2) AS 'Facebook_cost' FROM `lead_campaign_detail` lcd 
WHERE DATE(Date_time) BETWEEN 
(LAST_DAY(CURDATE() - INTERVAL 1 MONTH)) 
AND 
(CURDATE() - INTERVAL 1 day)
GROUP BY city'''
df_FBcost = pd.read_sql_query(query,engine)
engine.dispose()
df_FBcost.head()

                 city  Facebook_cost
0                         3708849.49
1                AGRA      115874.73
2  AMRITSAR/JALANDHAR       93088.59
3   AMRITSAR/JALNDHAR       38011.07
4           BENGALURU      511982.20

# 6) SQL QUERY FOR GOOGLE COST

In [6]:
engine = sqlalchemy.create_engine("mysql+pymysql://nitesh.kr:yRpRtyJR0XSqVLibLT@dms002.healthians.co.in/testenv_prod")
query = '''
SELECT SUBSTRING(lcd.campaign_name,1,LOCATE(':',lcd.campaign_name,1)-1) AS 'city',ROUND(SUM(sms_rate),2) AS 'Google_cost' 
FROM lead_campaign_detail lcd
WHERE lcd.vendor_id IN (4,69,118,122) AND DATE(Date_time) BETWEEN 
(LAST_DAY(CURDATE() - INTERVAL 1 MONTH)) 
AND 
(CURDATE() - INTERVAL 1 day)
GROUP BY city'''
df_Googlecost = pd.read_sql_query(query,engine)
engine.dispose()
df_Googlecost.head()

        city  Google_cost
0                55848.28
1  Bangalore    483312.98
2    Haryana     43668.10
3  Hyderabad    250888.49
4         MP     49080.00

# 7) SQL QUERY FOR CITY & STATE

In [7]:
%pwd
%cd D:\Raw_Data\City Vs State
df_city = pd.read_csv('city_vs_state.csv')

D:\Raw_Data\City Vs State

# 8) No. of days MTD & overall

In [8]:
now = datetime.datetime.now()
mtd_days=now.day
overall_days=calendar.monthrange(now.year, now.month)[1]

# 11) Booking & Revenue DETAILED

In [9]:
dfg2 = df_master.merge(df_city,left_on ='billing_cust_city',right_on = 'Lead_City', how = 'inner')
dfg3=dfg2.drop(columns = 'Lead_City')
dfg4=pd.DataFrame(dfg3.groupby(['State'])['Bookings'].sum())
dfg4.head()
dfg4.reset_index(inplace=True)

var = ['BOOKING_AMOUNT','Allocated_count','Allocated_amount','Cancelled_orders','Rescheduled_OnHold_Orders','Picked_Orders','Overall_Revenue','Phlebo_addon']
for num_var in var:
    dfg5=pd.DataFrame(dfg3.groupby(['State'])[num_var].sum())
    dfg4=pd.merge(dfg4,dfg5,left_on = 'State',right_on = 'State',how = 'inner')
    
dfg7=dfg4[['State','Bookings','BOOKING_AMOUNT','Allocated_count','Allocated_amount','Cancelled_orders','Rescheduled_OnHold_Orders','Picked_Orders','Overall_Revenue','Phlebo_addon']]

def var_sum(x):
    return pd.Series(np.sum(x))


dfg7 = dfg7._get_numeric_data().apply(lambda x : var_sum(x))

df_gross=pd.concat([dfg4,dfg7],sort=False)

df_gross['State'].fillna('Total',inplace = True)
df_gross

,State,Bookings,BOOKING_AMOUNT,Allocated_count,Allocated_amount,Cancelled_orders,Rescheduled_OnHold_Orders,Picked_Orders,Overall_Revenue,Phlebo_addon
0,BLR,2330,2647267.0,1820,2343764.0,402.0,489.0,1258.0,1832391.0,214559.0
1,Dehradun,681,775445.0,573,689035.0,130.0,148.0,366.0,569235.0,138929.0
2,HR,821,935333.0,706,828015.0,108.0,114.0,508.0,822581.0,268922.0
3,Hyderabad,1025,1109554.0,820,962649.0,202.0,249.0,490.0,674281.0,59186.0
4,Jaipur,622,702310.0,538,646672.0,94.0,114.0,382.0,578776.0,121254.0
5,MP,1102,782879.0,979,704315.0,136.0,172.0,723.0,661676.0,233666.0
6,Mumbai,2832,3711400.0,2243,3275033.0,601.0,645.0,1402.0,2446950.0,365168.0
7,NCR,16981,18126613.0,14683,16762135.0,1956.0,1969.0,11972.0,17088000.0,3664751.0
8,PCM,1187,1340983.0,1021,1251616.0,181.0,180.0,770.0,1190322.0,269218.0
9,Pune,1589,2057293.0,1270,1854977.0,355.0,361.0,781.0,1361138.0,243391.0
10,Punjab,2010,2129922.0,1758,1952429.0,271.0,255.0,1399.0,2329459.0,887803.0
11,UP,3114,3322845.0,2681,3052815.0,487.0,469.0,2028.0,2983111.0,838026.0
0,Total,34294,37641844.0,29092,34323455.0,4923.0,5165.0,22079.0,32537920.0,7304873.0

# 22) GROSS MARGIN DETAILED

In [10]:
df_margin['payed_amount']=df_margin['payed_amount'].apply(pd.to_numeric)

dfm2 = df_margin.merge(df_city,left_on ='billing_cust_city',right_on = 'Lead_City', how = 'inner')
dfm3=dfm2.drop(columns = 'Lead_City')
dfm4=pd.DataFrame(dfm3.groupby(['State'])['payed_amount'].sum())
dfm4.head()
dfm4.reset_index(inplace=True)

dfm5=pd.DataFrame(dfm3.groupby(['State'])['sum_addon_cost'].sum())
dfm4=pd.merge(dfm4,dfm5,left_on = 'State',right_on = 'State',how = 'inner')
dfm5=pd.DataFrame(dfm3.groupby(['State'])['order_id'].count())
dfm4=pd.merge(dfm4,dfm5,left_on = 'State',right_on = 'State',how = 'inner')

p=424552/overall_days*mtd_days
p

q_BLR=np.sum(dfm4.iloc[0:1,-1:])
q_BLR

q_HYD=np.sum(dfm4.iloc[3:4,-1:])
q_HYD

cost_prop_BLR = np.sum(p*(q_BLR/(q_HYD+q_BLR)))
cost_prop_BLR

cost_prop_HYD = np.sum(p*(q_HYD/(q_HYD+q_BLR)))
cost_prop_HYD

dfm4['blr_cost']=dfm4['State'].apply(lambda x:cost_prop_BLR if x=='BLR' else cost_prop_HYD if x=='Hyderabad' else 0.0) 
dfm4['Total_Cost']=dfm4['sum_addon_cost']+dfm4['blr_cost']
dfm4['Gross_Margin']=dfm4['payed_amount']-dfm4['Total_Cost']
dfm5=dfm4[['payed_amount', 'sum_addon_cost', 'order_id', 'blr_cost',
        'Total_Cost', 'Gross_Margin']]

def var_sum(x):
    return pd.Series(np.sum(x))

dfm5 = dfm5._get_numeric_data().apply(lambda x : var_sum(x))

dfm4=pd.concat([dfm4,dfm5],sort=False)
dfm4['State'].fillna('Total',inplace = True)

dfm4['Gross_Margin']=round(dfm4['Gross_Margin'],0)
dfm4['Gross_Margin/order']=round(dfm4['Gross_Margin']/dfm4['order_id'],0)
dfm4['Gross_Margin%']=round(dfm4['Gross_Margin']/dfm4['payed_amount'],2)
dfm4['ASP']=round(dfm4['payed_amount']/dfm4['order_id'],0)
df_margin_final=dfm4[['State','Gross_Margin','Gross_Margin/order','Gross_Margin%','ASP']]
df_margin_final

        State  Gross_Margin  Gross_Margin/order  Gross_Margin%     ASP
0         BLR     1111713.0               887.0           0.61  1459.0
1    Dehradun      352156.0               973.0           0.62  1562.0
2          HR      453628.0               907.0           0.56  1627.0
3   Hyderabad      401089.0               837.0           0.61  1381.0
4      Jaipur      315328.0               871.0           0.56  1552.0
5          MP      526743.0               733.0           0.80   918.0
6      Mumbai     1521481.0              1099.0           0.63  1754.0
7         NCR     9355009.0               791.0           0.55  1436.0
8         PCM      702270.0               917.0           0.59  1549.0
9        Pune      839320.0              1087.0           0.62  1749.0
10     Punjab     1169345.0               877.0           0.51  1705.0
11         UP     1707903.0               921.0           0.60  1528.0
0       Total    18455985.0               854.0           0.57  1487.0

# 33) LEADS DATA DETAILED

In [11]:
df_lead.dropna(axis=0,how = 'any').shape

dfl2 = df_lead.merge(df_city,left_on ='CITY',right_on = 'Lead_City', how = 'inner')
dfl3=dfl2.drop(columns = ['Lead_City'])
dfl3=dfl3.drop_duplicates(keep='last')

dfl4=pd.DataFrame(dfl3[(dfl3['Leads_Tag'] == 'Facebook')].groupby(['State'])['Leads'].sum())
dfl4.reset_index(inplace=True)

dfl5=pd.DataFrame(dfl3[(dfl3['Leads_Tag'] == 'Google')].groupby(['State'])['Leads'].sum())

dfl4=pd.merge(dfl4,dfl5,left_on = 'State',right_on = 'State', how = 'inner')
dfl4.rename(columns={'Leads_x':'Facebook','Leads_y':'Google'},inplace=True)

dfl6 = dfl4[['Facebook','Google']]

def var_sum(x):
    return pd.Series(np.sum(x))

dfl6 = dfl6._get_numeric_data().apply(lambda x : var_sum(x))

df_lead_final=pd.concat([dfl4,dfl6],sort=False)
df_lead_final['State'].fillna('Total',inplace = True)
df_lead_final

        State  Facebook  Google
0         BLR      4669    1675
1    Dehradun      1141     154
2          HR      1183     297
3   Hyderabad      2175     869
4      Jaipur      1084     293
5          MP      2199     224
6      Mumbai      5250    1832
7         NCR      8177    6013
8         PCM      1350     458
9        Pune      2818     852
10     Punjab      3098     456
11         UP      4176     904
0       Total     37320   14027

# 44) KIT COST DETAILED

In [12]:
dfk2 = df_kit.merge(df_city,left_on ='billing_cust_city',right_on = 'Lead_City', how = 'inner')
dfk3=dfk2.drop(columns = 'Lead_City')
dfk4=pd.DataFrame(dfk3.groupby(['State'])['kit_cost'].sum())
dfk4.head()
dfk4.reset_index(inplace=True)
dfk5 = dfk4[['kit_cost']]
def var_sum(x):
    return pd.Series(np.sum(x))

dfk5 = dfk5._get_numeric_data().apply(lambda x : var_sum(x))

df_kit_Final=pd.concat([dfk4,dfk5],sort=False)
df_kit_Final['State'].fillna('Total',inplace = True)
df_kit_Final

        State   kit_cost
0         BLR    59462.5
1    Dehradun    19798.5
2          HR    27704.5
3   Hyderabad    21373.0
4      Jaipur    20167.0
5          MP    31088.0
6      Mumbai    71020.0
7         NCR   580454.5
8         PCM    40602.0
9        Pune    38860.0
10     Punjab    80333.0
11         UP   103716.0
0       Total  1094579.0

# 55) FACEBOOK COST DETAILED

In [13]:
df_FBcost['city'].dropna(axis=0,inplace=True)
dfc1=df_FBcost.merge(df_city,left_on ='city',right_on = 'Lead_City', how = 'inner')
dfc1=dfc1.drop(columns = 'Lead_City')
dfc1['State'].dropna(inplace=True)

dfc2=pd.DataFrame(dfc1.groupby(['State'])['Facebook_cost'].sum())
dfc2.head()
dfc2.reset_index(inplace=True)

dfc3 = dfc2[['Facebook_cost']]
def var_sum(x):
    return pd.Series(np.sum(x))

dfc3 = dfc3._get_numeric_data().apply(lambda x : var_sum(x))

df_fbcost_final=pd.concat([dfc2,dfc3],sort=False)
df_fbcost_final['State'].fillna('Total',inplace = True)
df_fbcost_final

        State  Facebook_cost
0         BLR      511982.20
1    Dehradun      116692.80
2          HR      181897.01
3   Hyderabad      262517.37
4      Jaipur      160731.74
5          MP      130103.08
6      Mumbai      621616.21
7         NCR     1200529.00
8         PCM      225377.59
9        Pune      363341.53
10     Punjab      468241.94
11         UP      579383.84
0       Total     4822414.31

# 66) GOOGLE COST DETAILED

In [14]:
df_Googlecost['city'].dropna(axis=0,inplace=True)
dfc1=df_Googlecost.merge(df_city,left_on ='city',right_on = 'Lead_City', how = 'left')
dfc1=dfc1.drop(columns = 'Lead_City')
dfc1['State'].fillna('NCR',inplace=True)

dfc2=pd.DataFrame(dfc1.groupby(['State'])['Google_cost'].sum())
dfc2.head()
dfc2.reset_index(inplace=True)

dfc3 = dfc2[['Google_cost']]
def var_sum(x):
    return pd.Series(np.sum(x))

dfc3 = dfc3._get_numeric_data().apply(lambda x : var_sum(x))

df_Googlecost_final=pd.concat([dfc2,dfc3],sort=False)
df_Googlecost_final['State'].fillna('Total',inplace = True)
df_Googlecost_final

        State  Google_cost
0         BLR    483312.98
1    Dehradun     32320.14
2          HR     43668.10
3   Hyderabad    250888.49
4      Jaipur     86128.78
5          MP     49080.00
6      Mumbai    544990.59
7         NCR   1495353.68
8         PCM    130502.30
9        Pune    274385.53
10     Punjab    118874.64
11         UP    199337.00
0       Total   3708842.23

# FINAL MERGING OF ALL DF

In [15]:
df_MTD_FINAL1 = pd.merge(df_gross,df_margin_final,left_on='State',right_on='State',how='inner')

In [16]:
df_MTD_FINAL2=pd.merge(df_MTD_FINAL1,df_lead_final,left_on='State',right_on='State',how='inner')

In [17]:
df_MTD_FINAL3=pd.merge(df_MTD_FINAL2,df_kit_Final,left_on='State',right_on='State',how='inner')

In [18]:
df_MTD_FINAL4=pd.merge(df_MTD_FINAL3,df_fbcost_final,left_on='State',right_on='State',how='inner')

In [19]:
df_MTD_FINAL5=pd.merge(df_MTD_FINAL4,df_Googlecost_final,left_on='State',right_on='State',how='inner')
df_MTD_FINAL5

,State,Bookings,BOOKING_AMOUNT,Allocated_count,Allocated_amount,Cancelled_orders,Rescheduled_OnHold_Orders,Picked_Orders,Overall_Revenue,Phlebo_addon,Gross_Margin,Gross_Margin/order,Gross_Margin%,ASP,Facebook,Google,kit_cost,Facebook_cost,Google_cost
0,BLR,2330,2647267.0,1820,2343764.0,402.0,489.0,1258.0,1832391.0,214559.0,1111713.0,887.0,0.61,1459.0,4669,1675,59462.5,511982.20,483312.98
1,Dehradun,681,775445.0,573,689035.0,130.0,148.0,366.0,569235.0,138929.0,352156.0,973.0,0.62,1562.0,1141,154,19798.5,116692.80,32320.14
2,HR,821,935333.0,706,828015.0,108.0,114.0,508.0,822581.0,268922.0,453628.0,907.0,0.56,1627.0,1183,297,27704.5,181897.01,43668.10
3,Hyderabad,1025,1109554.0,820,962649.0,202.0,249.0,490.0,674281.0,59186.0,401089.0,837.0,0.61,1381.0,2175,869,21373.0,262517.37,250888.49
4,Jaipur,622,702310.0,538,646672.0,94.0,114.0,382.0,578776.0,121254.0,315328.0,871.0,0.56,1552.0,1084,293,20167.0,160731.74,86128.78
5,MP,1102,782879.0,979,704315.0,136.0,172.0,723.0,661676.0,233666.0,526743.0,733.0,0.80,918.0,2199,224,31088.0,130103.08,49080.00
6,Mumbai,2832,3711400.0,2243,3275033.0,601.0,645.0,1402.0,2446950.0,365168.0,1521481.0,1099.0,0.63,1754.0,5250,1832,71020.0,621616.21,544990.59
7,NCR,16981,18126613.0,14683,16762135.0,1956.0,1969.0,11972.0,17088000.0,3664751.0,9355009.0,791.0,0.55,1436.0,8177,6013,580454.5,1200529.00,1495353.68
8,PCM,1187,1340983.0,1021,1251616.0,181.0,180.0,770.0,1190322.0,269218.0,702270.0,917.0,0.59,1549.0,1350,458,40602.0,225377.59,130502.30
9,Pune,1589,2057293.0,1270,1854977.0,355.0,361.0,781.0,1361138.0,243391.0,839320.0,1087.0,0.62,1749.0,2818,852,38860.0,363341.53,274385.53
10,Punjab,2010,2129922.0,1758,1952429.0,271.0,255.0,1399.0,2329459.0,887803.0,1169345.0,877.0,0.51,1705.0,3098,456,80333.0,468241.94,118874.64
11,UP,3114,3322845.0,2681,3052815.0,487.0,469.0,2028.0,2983111.0,838026.0,1707903.0,921.0,0.60,1528.0,4176,904,103716.0,579383.84,199337.00
12,Total,34294,37641844.0,29092,34323455.0,4923.0,5165.0,22079.0,32537920.0,7304873.0,18455985.0,854.0,0.57,1487.0,37320,14027,1094579.0,4822414.31,3708842.23

In [20]:
dfl3_google = dfl3[dfl3['Leads_Tag'] == 'Google'].pivot_table(index=['State'],columns=['created_on'],values='Leads',aggfunc=np.sum)
dfl3_google.reset_index()

def var_sum(x):
    return pd.Series(np.sum(x))


dfl3_g_sum = dfl3_google._get_numeric_data().apply(lambda x : var_sum(x))

dfl3_google=pd.concat([dfl3_google,dfl3_g_sum],axis=0,sort=False)

dfl3_google.reset_index(inplace=True)
dfl3_google.rename(columns = {'index' : 'State'},inplace=True)
dfl3_google.fillna(0, inplace = True)
dfl3_google.loc[dfl3_google.shape[0]-1,'State'] = 'Total'
dfl3_google

created_on,State,2019-04-30,2019-05-01,2019-05-02,2019-05-03,2019-05-04,2019-05-05,2019-05-06,2019-05-07,2019-05-08,...,2019-05-20,2019-05-21,2019-05-22,2019-05-23,2019-05-24,2019-05-25,2019-05-26,2019-05-27,2019-05-28,2019-05-29
0,BLR,64,69,61,43,50,35,48,39,47,...,66,69,63,59,61,69,49,66,63,54
1,Dehradun,7,5,5,6,2,8,4,7,7,...,5,2,9,5,6,2,6,10,4,7
2,HR,6,10,14,11,9,12,4,11,20,...,3,14,9,3,16,10,11,12,21,3
3,Hyderabad,31,37,32,19,30,23,43,24,25,...,36,22,16,17,22,35,33,27,35,40
4,Jaipur,6,10,8,12,4,12,8,10,9,...,6,6,9,5,6,20,4,18,11,9
5,MP,9,8,7,4,7,6,6,6,9,...,9,6,8,3,8,7,13,14,12,3
6,Mumbai,64,52,81,60,55,52,55,66,59,...,48,66,54,54,64,64,52,68,71,83
7,NCR,206,227,156,205,231,155,211,185,239,...,194,189,175,196,214,204,202,240,304,206
8,PCM,19,16,15,18,17,19,11,9,15,...,17,12,12,14,11,14,8,11,19,11
9,Pune,35,32,36,26,33,25,28,22,29,...,25,22,28,17,39,29,26,29,24,43
10,Punjab,21,19,17,16,18,17,15,17,14,...,16,12,20,14,7,14,13,12,14,11
11,UP,37,33,34,27,27,23,21,32,28,...,23,37,31,25,32,31,29,34,43,22
12,Total,505,518,466,447,483,387,454,428,501,...,448,457,434,412,486,499,446,541,621,492

In [21]:
dfl3_fb = dfl3[dfl3['Leads_Tag'] == 'Facebook'].pivot_table(index=['State'],columns=['created_on'],values='Leads',aggfunc=np.sum)
dfl3_fb.reset_index()

def var_sum(x):
    return pd.Series(np.sum(x))


dfl3_fb_sum = dfl3_fb._get_numeric_data().apply(lambda x : var_sum(x))

dfl3_fb = pd.concat([dfl3_fb,dfl3_fb_sum],axis=0,sort=False)

dfl3_fb.reset_index(inplace=True)
dfl3_fb.rename(columns = {'index' : 'State'},inplace=True)
dfl3_fb.fillna(0, inplace = True)
dfl3_fb.loc[dfl3_fb.shape[0]-1,'State'] = 'Total'
dfl3_fb

created_on,State,2019-04-30,2019-05-01,2019-05-02,2019-05-03,2019-05-04,2019-05-05,2019-05-06,2019-05-07,2019-05-08,...,2019-05-20,2019-05-21,2019-05-22,2019-05-23,2019-05-24,2019-05-25,2019-05-26,2019-05-27,2019-05-28,2019-05-29
0,BLR,179,171,118,124,109,177,227,224,211,...,124,127,138,127,168,162,157,176,168,129
1,Dehradun,28,50,44,56,33,29,38,34,40,...,37,35,43,23,49,49,42,41,35,31
2,HR,41,43,49,43,47,39,36,28,66,...,29,19,18,17,23,24,22,19,17,19
3,Hyderabad,85,94,86,76,95,87,96,76,86,...,74,64,61,40,59,72,68,92,77,40
4,Jaipur,25,32,27,21,22,28,19,30,32,...,30,17,25,26,27,23,26,28,27,25
5,MP,86,72,79,94,81,57,75,73,64,...,85,88,73,75,90,76,65,102,74,67
6,Mumbai,170,190,184,203,161,147,187,160,216,...,143,154,188,184,189,133,143,127,163,123
7,NCR,271,272,222,260,227,244,244,273,305,...,305,278,275,262,342,240,296,363,352,300
8,PCM,45,65,47,43,47,40,51,32,52,...,39,33,26,17,22,25,23,31,29,23
9,Pune,81,85,89,92,86,97,101,84,78,...,37,59,84,80,101,93,108,92,113,91
10,Punjab,112,135,123,101,89,105,114,98,103,...,65,108,100,100,115,123,104,107,96,76
11,UP,104,119,130,166,125,144,134,90,144,...,174,194,164,122,168,149,182,147,155,119
12,Total,1227,1328,1198,1279,1122,1194,1322,1202,1397,...,1142,1176,1195,1073,1353,1169,1236,1325,1306,1043

In [22]:
df_MTD_FINAL4.to_csv('df_MTD_FINAL4.csv')

In [23]:
from openpyxl import load_workbook
book = load_workbook('leads_summary.xlsx')
writer = pd.ExcelWriter('leads_summary.xlsx', engine='openpyxl')
writer.book = book
df_MTD_FINAL5.to_excel(writer,sheet_name="MTD",header='infer', index=False,startcol=0,startrow=0)
dfl3_fb.to_excel(writer,sheet_name="MTD",header='infer', index=False,startcol=0,startrow=17)
dfl3_google.to_excel(writer,sheet_name="MTD",header='infer', index=False,startcol=0,startrow=35)
writer.save()